{"text":"I can't take this anymore — this semester is crushing me.","label":0}
{"text":"I feel like giving up because I'm failing my classes.","label":0}
{"text":"I'm terrified about my presentation and I feel like everyone will laugh at me.","label":0}
{"text":"I don't know what to do anymore about my exams — I'm overwhelmed.","label":0}
{"text":"I feel hopeless about my thesis progress, but I don't want to hurt myself.","label":0}
{"text":"I feel like I'm breaking down from all these deadlines.","label":0}
{"text":"I keep making mistakes in class and I'm scared people will judge me.","label":0}
{"text":"I can't understand what you just said — can you explain it differently about my study plan?","label":0}
{"text":"I don't know… I just feel like I'm going to fail the final.","label":0}
{"text":"What do you mean? I'm confused about the CBT question you asked.","label":0}
{"text":"I'm panicking because the assignment is due tonight.","label":0}
{"text":"I feel like I can't breathe when I think about the exam.","label":0}
{"text":"I'm so stressed I feel physically sick, but it's because of school.","label":0}
{"text":"I feel like everything is pointless when I look at my grades.","label":0}
{"text":"I feel numb after studying all day and still not getting it.","label":0}
{"text":"I can't cope with the pressure of this course right now.","label":0}
{"text":"I feel like people will laugh at my face if I answer wrong in class.","label":0}
{"text":"I hate public speaking and my graded presentation is tomorrow.","label":0}
{"text":"I'm overwhelmed by my coursework and I don't know where to start.","label":0}
{"text":"I don't want to drop out, but I feel like I can't keep up academically.","label":0}
{"text":"I feel like I'm spiraling because I bombed the midterm.","label":0}
{"text":"I'm scared I'm too stupid for this major.","label":0}
{"text":"I can't take the stress of finals week.","label":0}
{"text":"I'm losing sleep because of my thesis defense.","label":0}
{"text":"I can't focus at all; my mind keeps racing about deadlines.","label":0}
{"text":"I feel like I'm drowning in assignments.","label":0}
{"text":"I keep thinking I'm going to embarrass myself during the presentation.","label":0}
{"text":"I feel ashamed because I keep making careless mistakes on quizzes.","label":0}
{"text":"I'm frustrated and confused about the material — can you clarify?","label":0}
{"text":"I don't know why I'm so scared of failing, but it's consuming me.","label":0}
{"text":"I feel overwhelmed, but I am not suicidal.","label":0}
{"text":"I feel like giving up on studying, not on life.","label":0}
{"text":"I can't take this anymore… these exams are too much.","label":0}
{"text":"I'm terrified I'll disappoint my parents with my GPA.","label":0}
{"text":"I keep thinking everyone is smarter than me in this class.","label":0}
{"text":"I feel trapped by my course load.","label":0}
{"text":"I don't understand. What do you mean by cognitive distortion?","label":0}
{"text":"I feel like people will laugh at me if I ask questions in lecture.","label":0}
{"text":"I'm so anxious about school that I can't eat.","label":0}
{"text":"I'm overwhelmed with academic pressure; I need help reframing my thoughts.","label":0}
